code/Transbank/Webpay/logs/webpay-2017-06-21.txt

13:49:58 - datos request initTransaction 
Array
(
    [wSTransactionType] => TR_MALL_WS
    [commerceId] => 597020000542
    [buyOrder] => 000000145
    [sessionId] => 
    [returnURL] => http://sm-dev.xpectrumtech.com/webpay/payment/response
    [finalURL] => http://sm-dev.xpectrumtech.com/webpay/payment/success
    [transactionDetails] => Array
        (
            [commerceCode] => 597020000543
            [buyOrder] => 000000145
            [amount] => 2983.8
        )

)

13:49:59 - initTransaction request  - <?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-671458"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-671457"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>C/KKVIhVsKD715OgF1Xw3JYu56I=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>WUP+4tl/dgnADpCwDWQuw7fNxU+8fFwwlGTmjaCcGvBIowyrVGOECP6Z/xzosXpZVyGc5ObNG7eo
cV432nzXb0bjvJQUwdLeBGSp/HNcRR11wwWLXEYnuzbcLMenDiP2lUidSwMqq7GHEQGN6PZ76lCW
NYtwAVG5bvGYcBuxLe98FCqnEvMKvA2sasaaqq35kCaDLy+zYEx6yAwEu9Weh+/4uILZvXYivStb
OUsR8AW7YShTxI/73TMLnHiaJD4ycCCu21AXRPN175ksTUVVMy7H15z5VGC6p7jRVbPQFjnoO/2q
0Cbd6k5orc3jGaO7kAvnKAkvwV/uKdu9Dhdsrg==</ds:SignatureValue><ds:KeyInfo Id="KI-530FDA96CA8136399814980529994121007375"><wsse:SecurityTokenReference wsu:Id="STR-530FDA96CA8136399814980529994121007376"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=10,OU=kdu,O=kdu,L=Santiago,ST=Chile,C=CL</ds:X509IssuerName><ds:X509SerialNumber>1449520866</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-671457"><ns2:initTransactionResponse xmlns:ns2="http://service.wswebpay.webpay.transbank.com/"><return><token>e7b6535002a0f3104f3e5b58096ff2e192f2cbfe65fbab970bc4a0a960c0d5d5</token><url>https://webpay3gint.transbank.cl/filtroUnificado/initTransaction</url></return></ns2:initTransactionResponse></soap:Body></soap:Envelope>

13:49:59 - initTransaction response - <?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-671458"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-671457"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>C/KKVIhVsKD715OgF1Xw3JYu56I=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>WUP+4tl/dgnADpCwDWQuw7fNxU+8fFwwlGTmjaCcGvBIowyrVGOECP6Z/xzosXpZVyGc5ObNG7eo
cV432nzXb0bjvJQUwdLeBGSp/HNcRR11wwWLXEYnuzbcLMenDiP2lUidSwMqq7GHEQGN6PZ76lCW
NYtwAVG5bvGYcBuxLe98FCqnEvMKvA2sasaaqq35kCaDLy+zYEx6yAwEu9Weh+/4uILZvXYivStb
OUsR8AW7YShTxI/73TMLnHiaJD4ycCCu21AXRPN175ksTUVVMy7H15z5VGC6p7jRVbPQFjnoO/2q
0Cbd6k5orc3jGaO7kAvnKAkvwV/uKdu9Dhdsrg==</ds:SignatureValue><ds:KeyInfo Id="KI-530FDA96CA8136399814980529994121007375"><wsse:SecurityTokenReference wsu:Id="STR-530FDA96CA8136399814980529994121007376"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=10,OU=kdu,O=kdu,L=Santiago,ST=Chile,C=CL</ds:X509IssuerName><ds:X509SerialNumber>1449520866</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-671457"><ns2:initTransactionResponse xmlns:ns2="http://service.wswebpay.webpay.transbank.com/"><return><token>e7b6535002a0f3104f3e5b58096ff2e192f2cbfe65fbab970bc4a0a960c0d5d5</token><url>https://webpay3gint.transbank.cl/filtroUnificado/initTransaction</url></return></ns2:initTransactionResponse></soap:Body></soap:Envelope>

13:50:55 - transactionResult request  - <?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://service.wswebpay.webpay.transbank.com/"><SOAP-ENV:Body><ns1:getTransactionResult><tokenInput>e7b6535002a0f3104f3e5b58096ff2e192f2cbfe65fbab970bc4a0a960c0d5d5</tokenInput></ns1:getTransactionResult></SOAP-ENV:Body></SOAP-ENV:Envelope>

13:50:55 - transactionResult response - <?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-671462"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-671461"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>7YQHnM96UnMqJJFKOTGe8nEqgNc=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>SnKQOchmqkuLSeeaOPVqmgSoaTPvqZhE/T4svwp8jKkQfDecuXPXD70QmfnN69VAGDCvsMfBbXmw
WotAJEOb8QaG7LT11KPQhUovL571Wys3DbNq9bgX6jPgPn2p6yxV8hUnsWiJ8VYk/ETN8iPcQyY5
RCI2y7+7l34Hp/397UfTSxJEJY7WGK8R+qPIOv6yvceOvFMZ4cfSNM02ZZAFF45cuLa7K50VVArm
wN0bhLFu7FJRlAhMmA1f9MfbNjCnV82j3y3hcBfEtFL4OH7AI5txIf4Ri2jkF2cJuBGlxv9fv+mI
x43H1i2JMSduUJZFj4oXwEFtnaYu560bbXxX/A==</ds:SignatureValue><ds:KeyInfo Id="KI-530FDA96CA8136399814980530560651007381"><wsse:SecurityTokenReference wsu:Id="STR-530FDA96CA8136399814980530560651007382"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=10,OU=kdu,O=kdu,L=Santiago,ST=Chile,C=CL</ds:X509IssuerName><ds:X509SerialNumber>1449520866</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-671461"><ns2:getTransactionResultResponse xmlns:ns2="http://service.wswebpay.webpay.transbank.com/"><return><accountingDate>0621</accountingDate><buyOrder>000000145</buyOrder><cardDetail><cardNumber>6623</cardNumber></cardDetail><detailOutput><sharesNumber>0</sharesNumber><amount>2983.8</amount><commerceCode>597020000543</commerceCode><buyOrder>000000145</buyOrder><authorizationCode>1213</authorizationCode><paymentTypeCode>VN</paymentTypeCode><responseCode>0</responseCode></detailOutput><transactionDate>2017-06-21T09:49:55.304-04:00</transactionDate><urlRedirection>https://webpay3gint.transbank.cl/filtroUnificado/voucher.cgi</urlRedirection><VCI>TSY</VCI></return></ns2:getTransactionResultResponse></soap:Body></soap:Envelope>

13:50:57 - acknowledgeTransaction request  - <?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://service.wswebpay.webpay.transbank.com/"><SOAP-ENV:Body><ns1:acknowledgeTransaction><tokenInput>e7b6535002a0f3104f3e5b58096ff2e192f2cbfe65fbab970bc4a0a960c0d5d5</tokenInput></ns1:acknowledgeTransaction></SOAP-ENV:Body></SOAP-ENV:Envelope>

13:50:57 - acknowledgeTransaction response - <?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-671464"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-671463"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>QuITAD4hSg6Zo9sHn/WsuuwcxXg=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>PpojwILT330x6Td+9BNbTtvsj5Fz3Tt3aQFKj9eTKyOQzlp0yWaVKs1L4DyxGQu9CFWUiEsz5n2Q
je1bOz1dkvdVDOSHSutE8JO3glSrifra5yQ9i7WBH3NbmNjTMvM9I6/Y99hsh8OJ5VOHEXbnrDFw
GWWi08zff/odd9ge4FObJ5xC1vmxb650Z0ETrWS/5r9eCmnoj46CT8yTnLZx9rMKTd7s+V4TFuXd
J1lyj67SN262ByQ3MVaeTr3pZN0XCw1VqzUNgzBG+9eYZt516OKHnUjpq64C9Y1cl0QJIFkthePv
RgfG1DLhtuc2Vf6VY1NCKzBJ5K5slRqbrg2kYg==</ds:SignatureValue><ds:KeyInfo Id="KI-530FDA96CA8136399814980530577961007384"><wsse:SecurityTokenReference wsu:Id="STR-530FDA96CA8136399814980530577961007385"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=10,OU=kdu,O=kdu,L=Santiago,ST=Chile,C=CL</ds:X509IssuerName><ds:X509SerialNumber>1449520866</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-671463"><ns2:acknowledgeTransactionResponse xmlns:ns2="http://service.wswebpay.webpay.transbank.com/"/></soap:Body></soap:Envelope>

